# ElementIdSetFilter Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementIdSetFilter Class
Members See Also
---
A filter wrapping a set of elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public class ElementIdSetFilter : ElementQuickFilter
```

Visual Basic
---
```text
Public Class ElementIdSetFilter _
	Inherits ElementQuickFilter
```

Visual C++
---
```text
public ref class ElementIdSetFilter : public ElementQuickFilter
```

# Remarks
This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ElementFilter Autodesk.Revit.DB..::..ElementQuickFilter Autodesk.Revit.DB..::..ElementIdSetFilter
# See Also
ElementIdSetFilter Members
Autodesk.Revit.DB Namespace